# Food Demand Prediction

### Exploratory Data Analysis

Importing dependencies

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

Reading the csv file

In [2]:
df=pd.read_csv('Food demand.csv')

First 5 values in the dataset

In [3]:
df.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,1000000,3,157,2760,233.83,231.83,0,0,149
1,1000001,100,104,2956,486.03,583.03,0,0,161
2,1000002,143,75,1971,328.86,327.86,0,0,149
3,1000003,41,24,2539,145.53,145.53,0,0,540
4,1000004,45,83,2539,95.06,120.34,0,0,271

Last 5 values in the dataset

In [4]:
df.tail()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
1994,1002177,89,72,1311,130.04,177.51,0,0,68
1995,1002178,24,50,2444,604.31,606.31,0,0,109
1996,1002179,43,88,1971,291.06,291.06,0,0,366
1997,1002180,107,58,1543,473.39,473.39,0,1,42
1998,1002181,105,177,2322,284.27,284.27,0,0,485

Some basic information on the dataset

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1999 entries, 0 to 1998
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     1999 non-null   int64
 1   week                   1999 non-null   int64
 2   center_id              1999 non-null   int64
 3   meal_id                1999 non-null   int64
 4   checkout_price         1999 non-null   float64
 5   base_price             1999 non-null   float64
 6   emailer_for_promotion  1999 non-null   int64
 7   homepage_featured      1999 non-null   int64
 8   num_orders             1999 non-null   int64
dtypes: float64(2), int64(7)
memory usage: 140.7 KB

Shape of the dataset

In [6]:
df.shape

(1999, 9)

Names of the columns in dataset

In [7]:
df.columns

Index(['id', 'week', 'center_id', 'meal_id', 'checkout_price', 'base_price',
       'emailer_for_promotion', 'homepage_featured', 'num_orders'],
      dtype='object')

The unique values in the dataset

In [8]:
df.nunique()

id                       1999
week                      145
center_id                  77
meal_id                    51
checkout_price            642
base_price                576
emailer_for_promotion       2
homepage_featured           2
num_orders                255
dtype: int64

Null value count in of each column

In [9]:
df.isnull().sum()

id                       0
week                     0
center_id                0
meal_id                  0
checkout_price           0
base_price               0
emailer_for_promotion    0
homepage_featured        0
num_orders               0
dtype: int64

### Prediction using SVM

In [10]:
from sklearn import svm
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [11]:
X=df.drop(['id', 'num_orders'], axis=1)
y=df['num_orders']

In [12]:
X.head()

,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
0,3,157,2760,233.83,231.83,0,0
1,100,104,2956,486.03,583.03,0,0
2,143,75,1971,328.86,327.86,0,0
3,41,24,2539,145.53,145.53,0,0
4,45,83,2539,95.06,120.34,0,0

In [13]:
y.head()

0    149
1    161
2    149
3    540
4    271
Name: num_orders, dtype: int64

In [15]:
X_train, X_test, Y_train, Y_test= train_test_split(X,y,test_size=0.2)

In [16]:
print(X.shape, X_train.shape,X_test.shape)

(1999, 7) (1599, 7) (400, 7)

In [ ]:
svc = svm.SVC(kernel="linear").fit(X, y)

In [ ]:
print("Accuracy: {:.3f}".format(svc.score(X, y)))